import modules.reg_window
'''
    Небольшая справка по проетку:

    Команда lambda: 1 + 1 в кнопках явлвяется заполнителем, предотвращает ошибку.
    Все текстовые поля имеют ширину 0 так как они ее изменяют автоматически вместе
    с текстом.
    Виджет не может никогда быть закрытым, это является сердцем программы по сути.

    
    Список задач:

    Сделать строку поиска более удобной и имеющий дизайн как на фигме.
    Добавить возможность заполнять список городов.
    Исправить ошибку когда выбираешь другой город, то все еще пишеться что 
    "Текущая позиция"
    Добавить кнопки добавить/удалить для прогноза других городов.


    Список активности (тип - MD):
    15 - 0.8 +- 0.1
    1 - 0.65 +- 0.12
    20 - 0.15 +- 0.2
    16 - 0.35 +- 0.1

'''