import modules.widget
import modules.reg_window
'''
    Небольшая справка по проетку:

    Команда lambda: 1 + 1 в кнопках явлвяется заполнителем, предотвращает ошибку.
    Все текстовые поля имеют ширину 0 так как они ее изменяют автоматически вместе
    с текстом.
    Виджет не может никогда быть закрытым, это является сердцем программы по сути.

    
    Список задач:

    Нету :D

    
    Список проблем с оптимизацией:

    Долго загружается время текущего места
    Долгая ззагрузка всех городов
    Долгий запуск вообще чего угодно

    
    Список выполненых задач (тип - MD+):
    n - 0011 0101 %
    f - 0110 0000 %
    . - 1001 0000 %
    g - 0001 0101 %

'''